Tekla.Structures.ModelInternal.dotGetClipPlanes_t
Struct for ClipPlanes

Tekla.Structures.ModelInternal.dotGetClipPlanes_t.nPlanes
The number of clipplanes of view, max number is 6.

Tekla.Structures.ModelInternal.dotGetClipPlanes_t.aPlaneIDs


Tekla.Structures.ModelInternal.dotGetClipPlanes_t.aIsBorderVisible
The visibility of the clipplanes borders.

Tekla.Structures.ModelInternal.dotGetClipPlanes_t.aIsScissorVisible
The visibility of the clipplanes scissor icons.

Tekla.Structures.ModelInternal.dotGetClipPlanes_t.aX
The x-coordinates of all location points.

Tekla.Structures.ModelInternal.dotGetClipPlanes_t.aY
The y-coordinates of all location points.

Tekla.Structures.ModelInternal.dotGetClipPlanes_t.aZ
The z-coordinates of all location points.

Tekla.Structures.ModelInternal.dotGetClipPlanes_t.aUpX
The x-coordinates of all up direction vectors.

Tekla.Structures.ModelInternal.dotGetClipPlanes_t.aUpY
The y-coordinates of all up direction vectors.

Tekla.Structures.ModelInternal.dotGetClipPlanes_t.aUpZ
The z-coordinates of all up direction vectors.